# BoundaryXRotationSpring Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryXRotationSpring Property
ParameterTypeId Class See Also
---
"X Rotation - Spring"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryXRotationSpring { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryXRotationSpring As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryXRotationSpring {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace